:PROPERTIES:
:ID: EF2D7EDC-4470-4976-8A29-4189103CDC15
:END:
#+title: Add
#+description: Add a new currency with change reason code and commentary via currencies add.
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:currencies:
#+created: 2026-05-21
#+updated: 2026-06-06

Add a new currency. The command takes seven arguments: ISO code,
name, numeric code, symbol, fractions per unit, change reason code,
and change commentary — the last two feed the audit trail and are
mandatory (the =currencies_change_reason_code_check= constraint
rejects rows without a valid reason code).

#+name: currencies-add
#+begin_src ores-shell :exports none
currencies add TEST700 Test700 700 T7 100 system.test "shell recipe example"
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<currencies-add>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :42221
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.19
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Currency added successfully!
ores-shell> Bye!
#+end_example
